[
    {
        "desc": "Remastered reissue of 1987 album features 18 tracks including 7 bonus tracks, 'Jimmy Brown' (Early Version of 'Bring On The Dancing Horses' - prev. unreleased), 'Hole In The Holy' (prev. unreleased), 'Soul Kitchen' (prev. unreleased), 'The Game' (Acoustic Demo - prev. unreleased), 'Bedbugs & Ballyhoo' (Original Vers - prev. unreleased), 'Over Your Shoulder', & 'Bring On The Dancing Horses' (Extended Mix). 25th anniversary expanded edition features new liner notes & unseen photos. Slipcase. WSM. 2003.",
        "id": 1,
        "name": "Echo & The Bunnymen - Echo & The Bunnymen",
        "picture": "http://ecx.images-amazon.com/images/I/514Z5rUtJkL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "Recorded at the Red Rocks Amphitheatre in Colorado on 5th June 1983, Live at Red Rocks will be available for the first time on DVD, and will include 5 previously unreleased songs, a director's commentary, digitally re-graded pictures and a 5.1 mix. 1. Out Of Control  2. Twilight  3. An Cat Dubh 4. Into The Heart  5. Surrender  6. Two Hearts Beat As One  7. Seconds  8. Sunday Bloody Sunday  9. Cry 10.The Electric Co.  11. October  12. New Year's Day  13. I Threw A Brick Through A Window  14. A Day Without Me  15. Gloria  16. Party Girl  17. 11 O'Clock Tick Tock  18. I Will Follow  19. \"40\"",
        "id": 2,
        "name": "U2 Live at Red Rocks: Under a Blood Red Sky",
        "picture": "http://ecx.images-amazon.com/images/I/41EyY1Lv9kL._SL160_.jpg",
        "price": 615
    },
    {
        "desc": "Killing Joke need little introduction. Taking their name from a British phrase referring to an ironic or paradoxical situation or event, their brand of apocalyptic post punk and fiercely intense live shows fast established them as one of the most original bands to emerge from the UK in the late 70’s. Fronted by self confessed misanthropist Jaz Coleman, his influence, along with guitarist Geordie and bass players Youth and later Raven, can be found in bands such as Metallica, Marilyn Manson, Nine Inch Nails, Therapy?, Nirvana and many more. <P>Killing Joke - XXV Gathering: The Band That Preys Together Stays Together was filmed on their sold out 25th Anniversary show at the Shepherd’s Bush Empire in London and captures the band at their very best. Singer Coleman’s intense stage presence is unmatchable still after all these years while the titanic guitar sound of Geordie is awe-inspiring. Tracks like War Dance,Wait, Psyche and Song and Dance seem more relevant now than the day they were written, while opening track Communion is mesmerizing. Finally it’s now Killing Joke’s time. <P>Killing Joke- XXV Gathering: The Band That Preys Together Stays Together is the only DVD available from Killing Joke. <P>Tracklisting:<BR> 1) Communion<BR> 2) War Dance<BR> 3) Song and Dance<BR> 4) Primitive<BR> 5) Total Invasion<BR> 6) Blood Sport<BR> 7) Requiem<BR> 8) Asteroid<BR> 9) Wait<BR> 10) Whiteout<BR> 11) Psyche<BR> 12) Pandies<BR> 13) Complications<BR> 14) Sun Goes Down<BR> 15) Are You Receiving?<BR> 16) Love Like Blood<BR> 17) Pandemonium",
        "id": 3,
        "name": "Killing Joke - XXV Gathering: The Band That Preys Together Stays Together",
        "picture": "http://ecx.images-amazon.com/images/I/511F743254L._SL160_.jpg",
        "price": 461
    },
    {
        "desc": "MISSING BOOKLET. Two DVD set with slipcover. Light scuff on Disc One will not affect play. Well over 200 minutes. MISSING BOOKLET.",
        "id": 4,
        "name": "Depeche Mode - Videos 86>98 +",
        "picture": "http://ecx.images-amazon.com/images/I/41GJS1JT1GL._SL160_.jpg",
        "price": 923
    },
    {
        "desc": "Critically lauded Nashville-based singer-songwriter Mindy Smith will hit the road in support of her self-titled fifth studio album set for June 26 release on Giant Leap/TVX Records. The 20- city tour kicks off July 1, in Nashville with stops in Birmingham, Atlanta, Philadelphia, New York, Chicago, Minneapolis and Knoxville, among others. Co-produced with Jason Lehning, the collection features 11 original compositions seven of which Smith wrote with the remaining four as co-writes. Prior to the release of her 2004 debut, the New York native charmed fans with her rendition of Dolly Parton s Jolene for the much-praised Dolly Parton tribute album Just Because I'm a Woman. Her Vanguard Records debut album, One Moment More, went on to earn numerous critical accolades, featured the hit single Come to Jesus and sold over 300,000 copies. She subsequently released Long Island Shores (Vanguard, 2006), My Holiday (Vanguard, 2007) and Stupid Love (Vanguard, 2009). In August 2011, Mindy and longtime friend Daniel Tashian recorded Taking You With Me, a duet featured in the film and soundtrack for Paul Rudd s film Our Idiot Brother. Her music s also been featured in national television shows such as Grey s Anatomy, HBO's Six Feet Under and the WB's Smallville and Summerland.",
        "id": 5,
        "name": "Mindy Smith - Mindy Smith",
        "picture": "http://ecx.images-amazon.com/images/I/51YyR9mx0YL._SL160_.jpg",
        "price": 369
    },
    {
        "desc": "U2'S RECORD BREAKING ROSE BOWL CONCERT ON DVD TO BE RELEASED ON JUNE 3 <P>March 30, 2010 - Santa Monica, CA - U2360° At The Rose Bowl will be released on DVD and Blu-ray by Interscope Records on June 3, coinciding with the band's first U.S. show in 2010.  U2360° At The Rose Bowl was the penultimate gig of last year's U2360° tour in support of their Grammy-nominated album No Line on The Horizon.  The Rose Bowl performance was the band's biggest show of 2009 and U2's biggest ever US show, with a live audience in excess of 97,000. <P>The show was also streamed across seven continents via YouTube. The first ever live streaming of a full-length stadium concert, U2360° at the Rose Bowl had over 10 million views on the channel in one week. <P>Shot entirely in HD, the concert was filmed with 27 cameras and directed by Tom Krueger who had previously worked on U23D, the first live action 3D concert movie taken from U2's Vertigo Tour.Available in standard and two disc deluxe DVD formats, U2360° At The Rose Bowl will also be U2's first concert available in Blu-ray. The deluxe formats and the Blu-ray will feature a new documentary called Squaring the Circle: Creating U2360°, with new interviews from U2, Paul McGuinness and the team behind the touring production.Tracklisting: Get On Your Boots, Magnificent, Mysterious Ways, Beautiful Day, I Still Haven't Found What I'm Looking For, Stuck In A Moment You Can't Get Out Of, No Line On The Horizon, Elevation, In A Little While, Unknown Caller, Until the End of the World, The Unforgettable Fire, City of Blinding Lights, Vertigo, I'll Go Crazy If I Don't Go Crazy Tonight, Sunday Bloody Sunday, MLK, Walk On, One, Where The Streets Have No Name, Ultra Violet (Light My Way), With Or Without You, Moment Of Surrender. <P>The ground breaking U2360° tour continues this year, with the US leg opening in Salt Lake City on June 3, and the European leg opening in Turin, Italy on August 6.  U2 will headline Glastonbury on June 25th. <P>U2360° Tour Dates June 3, Salt Lake City, UT; June 6 & 7, Anaheim CA; June 12, Denver, CO; June 16, Oakland, CA; June 20, Seattle WA; June 23, Edmonton WA; June 25, Glastonbury UK; June 27, Minneapolis MN; June 30, East Lansing MI; July 3, Toronto ON; July 6, Chicago IL; July 9, Miami FL; July 12, Philadelphia, PA; July 12, Montreal QC; July 17, Montreal QC; July 19, New York, NY; August 6, Turin, Italy; August, 10, Frankfurt, Germany; August 12, Hannover, Germany; August 15 & 16, Horsens, Denmark; August 20 & 21, Helsinki, Finland; August, 25, Moscow, Russia; August 30, Vienna, Austria; Sept. 3, Athens, Greece; Sept 6, Istanbul, Turkey; September 11, Zurich, Switzerland; Sept. 12, Zurich, Switzerland; Sept. 15, Munich, Germany; Sept. 18, Paris, France; Sept,. 22 & 23, Brussels, Belgium; Sept. 26, San Sebastian, Spain; Sept. 29, Seville, Spain; October 2 & 3, Coimbra, Portugal; Oct. 8, Rome, Italy.",
        "id": 6,
        "name": "U2 - 360° AT THE ROSE BOWL",
        "picture": "http://ecx.images-amazon.com/images/I/51yV788W5LL._SL160_.jpg",
        "price": 615
    },
    {
        "desc": "Their 1972 debut.",
        "id": 7,
        "name": "Roxy Music - Roxy Music",
        "picture": "http://ecx.images-amazon.com/images/I/51KOjlBfzzL._SL160_.jpg",
        "price": 367
    },
    {
        "desc": "Get disc one of the above set, 16 tracks of classic U2!",
        "id": 8,
        "name": "U2 - U2 - The Best of 1990-2000",
        "picture": "http://ecx.images-amazon.com/images/I/410r4X-xVCL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "1995 anthology, originally released to coincide with the release of the four disc box set Thrill Of It All. Roxy Music began life as a British Art Rock band in the early '70s but by the time they split a decade later, they had matured into a smooth Rock outfit capable of creating some of the most lush, romantic and beautiful music on the Pop charts. Lead vocalist Bryan Ferry carried on the Roxy tradition on his solo albums recorded during and after the band's original 10 year career. This compilation includes the Ferry songs 'Is Your Love Strong Enough' (from the movie Legend) and 'Your Painted Smile' from the album Mamouna, both of which were not included on the U.S. equivalent.  20 tracks total.",
        "id": 9,
        "name": "Bryan Ferry, Roxy Music - More Than This: The Best Of Bryan Ferry & Roxy Music",
        "picture": "http://ecx.images-amazon.com/images/I/515%2BwEx0mbL._SL160_.jpg",
        "price": 523
    },
    {
        "desc": "Vitamin's decision to combine the catalogs of Joy Division and New Order for this string tribute is likely sound thinking; as the groups progressed from former to latter, so does this recording. It begins with the most obvious and effective Joy Division material: \"Love Will Tear Us Apart,\" \"She's Lost Control,\" \"Isolation,\" and \"New Dawn Fades.\" Of these, \"Isolation\" might work best, since its tension is made even more palpable by the insistent, screeching violins. The set moves into its second half with a stirring and methodically slow version of \"Bizarre Love Triangle.\" The cello, violins, and viola don't do as well with \"Blue Monday,\" but \"True Faith\" becomes the record's high point with its robust bottom end and plaintive melody. ~ Johnny Loftus, Rovi",
        "id": 10,
        "name": "Peter / Gilbert, Gillian / Sumner, Bernard / Morris Hook, Tom Tally, Kerryn Coulter, Tom Talley, Anja Grant, Stephanie Lindner, Keiko \" Mocha\" Ishibashi - String Quart Tribute to New Order & Joy Divis",
        "picture": "http://ecx.images-amazon.com/images/I/412VAF7KPXL._SL160_.jpg",
        "price": 523
    },
    {
        "desc": "Playing 102 shows in 40 countries, Depeche Mode's acclaimed Tour Of The Universe saw Dave Gahan, Martin Gore and Andrew 'Fletch' Fletcher performing to over 2.7 million people.<P> Their epic trip across the globe was one of the most successful tours of recent history and saw them playing a host of stunning material spanning their impressive 30 year history.<P> \"Tour Of The Universe - Live In Barcelona\" contains 21 tracks recorded over two sold out nights at the Palau St Jordi in Barcelona on November 20th and 21st 2009, both shows being highlights of the celebrated tour.<P> This spectacular DVD release comes with a host of bonus content including four bonus tracks recorded across the two nights, a tour documentary - Inside The Universe - two tracks filmed at tour rehearsals in New York and Anton Corbijn's specially created \"screen films\" for seven tracks plus further bonus montages created from the on-stage screens.<P> In addition the four promotional videos from 2009's acclaimed 'Sounds Of The Universe' album including the Grammy nominated Wrong, directed by Patrick Daughters, are included.<P> Blu-ray DVD tracklisting:<P> Disc 1<br> AudioVisual <br> 1. Intro (Live In Barcelona) <br> 2. In Chains (Live In Barcelona) <br> 3. Wrong (Live In Barcelona) <br> 4. Hole To Feed (Live In Barcelona) <br> 5. Walking In My Shoes (Live In Barcelona) <br> 6. It's No Good (Live In Barcelona) <br> 7. A Question Of Time (Live In Barcelona) <br> 8. Precious (Live In Barcelona) <br> 9. Fly On The Windscreen (Live In Barcelona) <br> 10. Jezebel (Live In Barcelona) <br> 11. Home (Live In Barcelona) <br> 12. Come Back (Live In Barcelona) <br> 13. Policy Of Truth (Live In Barcelona) <br> 14. In Your Room (Live In Barcelona) <br> 15. I Feel You (Live In Barcelona) <br> 16. Enjoy The Silence (Live In Barcelona) <br> 17. Never Let Me Down Again (Live In Barcelona) <br> 18. Dressed In Black (Live In Barcelona) <br> 19. Stripped (Live In Barcelona) <br> 20. Behind The Wheel (Live In Barcelona) <br> 21. Personal Jesus (Live In Barcelona) <br> 22. Waiting For The Night (Live In Barcelona) <br> 23. World In My Eyes (Live In Barcelona) <br> 24. Sister Of Night (Live In Barcelona) <br> 25. Miles Away / The Truth Is (Live In Barcelona) <br> 26. One Caress (Live In Barcelona) <P> High Definition Audiovisual <br> 1. Intro (Live In Barcelona) <br> 2. In Chains (Live In Barcelona) <br> 3. Wrong (Live In Barcelona) <br> 4. Hole To Feed (Live In Barcelona) <br> 5. Walking In My Shoes (Live In Barcelona) <br> 6. It's No Good (Live In Barcelona) <br> 7. A Question Of Time (Live In Barcelona) <br> 8. Precious (Live In Barcelona) <br> 9. Fly On The Windscreen (Live In Barcelona) <br> 10. Jezebel (Live In Barcelona) <br> 11. Home (Live In Barcelona) <br> 12. Come Back (Live In Barcelona) <br> 13. Policy Of Truth (Live In Barcelona) <br> 14. In Your Room (Live In Barcelona) <br> 15. I Feel You (Live In Barcelona) <br> 16. Enjoy The Silence (Live In Barcelona) <br> 17. Never Let Me Down Again (Live In Barcelona) <br> 18. Dressed In Black (Live In Barcelona) <br> 19. Stripped (Live In Barcelona) <br> 20. Behind The Wheel (Live In Barcelona) <br> 21. Personal Jesus (Live In Barcelona) <br> 22. Waiting For The Night (Live In Barcelona) <br> 23. World In My Eyes (Live In Barcelona) <br> 24. Sister Of Night (Live In Barcelona) <br> 25. Miles Away / The Truth Is (Live In Barcelona) <br> 26. One Caress (Live In Barcelona) <P> Disc 2<br> AudioVisual<br> 1. \"Most people just worry about hitting the right note\" - Inside The Universe <br> 2. In Chains (Tour Of The Universe / Screens) <br> 3. Walking In My Shoes (Tour Of The Universe / Screens) <br> 4. Precious (Tour Of The Universe / Screens) <br> 5. Come Back (Tour Of The Universe / Screens) <br> 6. Policy Of Truth (Tour Of The Universe / Screens) <br> 7. Enjoy The Silence (Tour Of The Universe / Screens) <br> 8. Personal Jesus (Tour Of The Universe / Screens) <br> 9. Wrong (Tour Of The Universe / Rehearsals) <br> 10. Walking In My Shoes (Tour Of The Universe / Rehearsals) <br> 11. Insight / Live <br> 12. Hole To Feed / Live Screen Montage <br> 13. Behind The Wheel / Barcelona Montage <br> 14. Never Let Me Down Again / Live Screen Montage <br> 15. Wrong <br> 16. Peace <br> 17. Hole To Feed <br> 18. Fragile Tension <P> High Definition Audiovisual <br> 1. \"Most people just worry about hitting the right note\" - Inside The Universe <br> 2. In Chains (Tour Of The Universe / Screens) <br> 3. Walking In My Shoes (Tour Of The Universe / Screens) <br> 4. Precious (Tour Of The Universe / Screens) <br> 5. Come Back (Tour Of The Universe / Screens) <br> 6. Policy Of Truth (Tour Of The Universe / Screens) <br> 7. Enjoy The Silence (Tour Of The Universe / Screens) <br> 8. Personal Jesus (Tour Of The Universe / Screens) <br> 9. Wrong (Tour Of The Universe / Rehearsals) <br> 10. Walking In My Shoes (Tour Of The Universe / Rehearsals) <br> 11. Insight / Live <br> 12. Hole To Feed / Live Screen Montage <br> 13. Behind The Wheel / Barcelona Montage <br> 14. Never Let Me Down Again / Live Screen Montage <br> 15. Wrong <br> 16. Peace <br> 17. Hole To Feed <br> 18. Fragile Tension",
        "id": 11,
        "name": "Depeche Mode: Tour of the Universe - Barcelona 20/21:11:09 [Blu-ray] [Limited Edition]",
        "picture": "http://ecx.images-amazon.com/images/I/51SqiAkIjqL._SL160_.jpg",
        "price": 1632
    },
    {
        "desc": "Two disc set. Rhino's Two DVD set Live In Glasgow stills the very best moments from those landmark shows with eighteen career-spanning songs including Joy Division classics. The set also features a bonus disc of previously unreleased footage from New Order's archives, presenting peak-form live performances from 1981-2006.  New Order's groundbreaking fusion of postpunk/new wave rock, synth-pop and dance music made them one of the most influential bands of the 1980s. After sitting out much of the '90s, they reemerged with acclaimed albums in 2001 (Get Ready) and 2005 (Waiting For The Sirens' Call), and in late 2006, performed a rare and celebratory two-night stand in Glasgow, Scotland.",
        "id": 12,
        "name": "New Order: Live in Glasgow",
        "picture": "http://ecx.images-amazon.com/images/I/31OCe0-F5UL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "This collection spans the band's entire 26 year career and includes 16 of the band's best known songs. Two brand new tracks have been recorded for the album: 'The Saints Are Coming', a collaboration with Green Day, which is the album's first single, and second single, 'Window On The Sky'. Both tracks are produced by Rick Rubin.",
        "id": 13,
        "name": "U2 - U218 Singles",
        "picture": "http://ecx.images-amazon.com/images/I/51YN3TTDEaL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "Japanese edition of eagerly anticipated 2003 album, features 12 tracks including 2 bonus tracks, 'Inferno' and 'Zennen'. Epic.",
        "id": 14,
        "name": "Killing Joke - Killing Joke",
        "picture": "http://ecx.images-amazon.com/images/I/31aEYP%2B%2BaYL._SL160_.jpg",
        "price": 1570
    },
    {
        "desc": "The 1953 recording features the spectacular twenty-six year old Leontyne Price, accompanied by Samuel Barber at the Library of Congress.  The duo's entire recital is issued whole for the first time. In this recital the soprano and composer give the world premiere performance of Barber's \"Hermit Songs\", and perform Henri Sauguet's \"La Voyante\" (The Fortune Teller) and other songs by Barber, Poulenc and Fauré. <P>This remarkable 1938 recording, released to the public for the first time, gives us the 28 year old baritone, Samuel Barber in 12 songs, accompanying himself at the piano. These little known performances reveal Barber as a singer/player of uncommonly deep communicative power. The performances (issued in cooperation with Mr. Barber's estate and the Curtis Institute in Philadelphia) include folk songs from England, America, the Tyrol and Tuscany as well as lieder by Schumann, Brahms, Mendelssohn, C.P.E Bach and Schubert.",
        "id": 15,
        "name": "Leontyne Price & Samuel Barber: Historic Performances, 1938 & 1953",
        "picture": "http://ecx.images-amazon.com/images/I/51sfmjuo8XL._SL160_.jpg",
        "price": 523
    },
    {
        "desc": "Rock group U2 travels across the U.S. during their sell-out Joshua Tree tour. 1988/color-b&w/99 min/PG-13.",
        "id": 16,
        "name": "U2 - Rattle and Hum",
        "picture": "http://ecx.images-amazon.com/images/I/51H5ZMS4ZZL._SL160_.jpg",
        "price": 276
    },
    {
        "desc": "In 2011, U2 returned to Hansa Studios in Berlin to discuss the making of Achtung Baby. From The Sky Down, is a documentary film directed by Academy Award winning director Davis Guggenheim (It Might Get Loud, Waiting for Superman, An Inconvenient Truth). <br><br><br>Screened in the UK as part of the BBC's Imagine Series, From The Sky Down was the first ever documentary film to open the prestigious Toronto International Film Festival. From The Sky Down includes bonus footage of So Cruel, Love Is Blindness, and The Fly shot in May 2011 during the band's visit to Hansa Studios to mark the 20th anniversary of Achtung Baby; as well as a Q&A with Bono, The Edge and Davis Guggenheim filmed at the Toronto International Film Festival in September 2011.<br><br><br>Twenty years after the release of U2's Achtung Baby (1991), Davis Guggenheim charts the path toward this groundbreaking album. Guggenheim uses animation and unseen footage from Berlin and Dublin alongside conversation to reveal what is now a key chapter in U2 s career.",
        "id": 17,
        "name": "U2: From The Sky Down [Blu-ray]",
        "picture": "http://ecx.images-amazon.com/images/I/51u7gh1bRPL._SL160_.jpg",
        "price": 769
    },
    {
        "desc": "Really in stock ! Delivery is usually 5-8 working days.",
        "id": 18,
        "name": "et al Johannes Brahms (Composer) - Baby Needs Brahms",
        "picture": "http://ecx.images-amazon.com/images/I/51s05Vq0irL._SL160_.jpg",
        "price": 307
    },
    {
        "desc": "Import only collection geared more towards their UK and European fan base but does include their domestic hits, 'Don't You Want Me' (Original Version) and (Snap 7-inch Remix), 'Love Action (I Believe in Love)', '(Keep Feeling) Fascination', 'Human' along with their European Hits and favored early electro tracks. An essential purchase for those who want to (re)discover the bands repertoire. EMI.",
        "id": 19,
        "name": "Human League - Human League - Greatest Hits",
        "picture": "http://ecx.images-amazon.com/images/I/416lrgmQ6gL._SL160_.jpg",
        "price": 492
    },
    {
        "desc": "Remastered 25th anniversary edition with four bonus tracks including two previously unreleased mixes of 'Change' and 'Requiem'. EG. 2005.",
        "id": 20,
        "name": "Killing Joke - Killing Joke",
        "picture": "http://ecx.images-amazon.com/images/I/61YmotIJbGL._SL160_.jpg",
        "price": 305
    },
    {
        "desc": "Limited Edition Japanese pressing of this album comes housed in a miniature LP sleeve. 2007.",
        "id": 21,
        "name": "Roxy Music - Roxy Music [Vinyl]",
        "picture": "http://ecx.images-amazon.com/images/I/41QTdCx03TL._SL160_.jpg",
        "price": 646
    },
    {
        "desc": "Formato: DVD-MULTIZ",
        "id": 22,
        "name": "Depeche Mode: The Videos 86 - 98",
        "picture": "http://ecx.images-amazon.com/images/I/71DZNY1EG6L._SL160_.gif",
        "price": 615
    },
    {
        "desc": "This intriguing release follows the journey of Mode fans who won a contest to see the band in Pasadena in June 1988. Includes the entire concert, plus bonus concert footage and more! Tracks include Master and Servant; Pimpf; Behind the Wheel; Strangelove , and more. 2 DVDs. 1988/color/3 hrs., 38 min/NR/fullscreen.",
        "id": 23,
        "name": "Depeche Mode - 101",
        "picture": "http://ecx.images-amazon.com/images/I/51l%2BiMsARDL._SL160_.jpg",
        "price": 769
    },
    {
        "desc": "Import only collection geared more towards their UK and European fan base but does include their domestic hits, 'Don't You Want Me' (Original Version) and (Snap 7-inch Remix), 'Love Action (I Believe in Love)', '(Keep Feeling) Fascination', 'Human' along with their European Hits and favored early electro tracks. An essential purchase for those who want to (re)discover the bands repertoire. EMI.",
        "id": 24,
        "name": "Human League - Human League - Greatest Hits",
        "picture": "http://ecx.images-amazon.com/images/I/411DTC26Y2L._SL160_.jpg",
        "price": 461
    },
    {
        "desc": "Limited Edition two disc (CD + PAL/Region 0 DVD) pressing of this digitally remastered and expanded edition of the 1985 compilation by this brilliant Post-Punk/New Wave band from Liverpool. Bonus DVD includes twelvevideos including 'The Cutter', 'The Killing Moon', 'Seven Seas', 'Bring On The Dancing Horses', 'The Game', 'Lips Like Sugar', 'Nothing Lasts Forever' and 'Rust'. The 2006 version of the CD, which is in a different running order and now spans the years 1979-2006,  drops one track, 'The Puppet', and replaces it with ten others: 'I Want To Be There When You Come', 'Don't Let It Get You Down', 'People Are Strange', 'The Game', 'Rust', 'Lips Like Sugar', 'Nothing Lasts Forever', 'Hang On To A Dream', 'It's Alright' and 'Stormy Weather'. 20 tracks total. Also features unique artwork! Korova.",
        "id": 25,
        "name": "Echo & Bunnymen - Vbo Echo & Bunnymen (CD/Dvd)",
        "picture": "http://ecx.images-amazon.com/images/I/51rdRBjm4nL._SL160_.jpg",
        "price": 1077
    },
    {
        "desc": "Hailed as the most popular electronic band in the world, Depeche Mode celebrates its 25th anniversary with the group's first genuine ''best of'' collection (selected recordings rather than a compilation). The Best Of Volume 1 brings together 17 singles spanning 1981-2005, from ''Just Can't Get Enough,'' ''Everything Counts,'' ''Personal Jesus'' and ''Enjoy The Silence'' to the recent ''Precious,'' plus a new track, ''Martyr.'' One of music's most influential artists, Depeche Mode has sold more than 72 million records and remains one of today's most highly regarded and passionately supported groups.",
        "id": 26,
        "name": "Depeche Mode - Best of Depeche Mode 1",
        "picture": "http://ecx.images-amazon.com/images/I/51y4m4lzYrL._SL160_.jpg",
        "price": 584
    },
    {
        "desc": "1. Prepare Ye The Way <BR> 2. A New Hallelujah<BR> 3. When I Think Of You<BR> 4. Mighty To Save<BR> 5. Shout Unto God<BR> 6. Amazing Grace (My Chains Are Gone)<BR> 7. Deep In Love With You<BR> 8. Healing Rain/ Let It Rain<BR> 9. Majesty<BR> 10. I Surrender All<BR> 11. Oh Draw Me Lord (Draw Me Near)<BR> 12. Grace<BR> 13. Help Is On The Way<BR> 14. The River Is Rising<BR> 15. Love In His Right Hand<BR> 16. Siwano<BR> 17. A New Hallelujah (Reprise)<BR><BR> Bonus Features:<BR> - Behind The Scenes: A New Hallelujah<BR> - 4 New Tracks From The Live Concert Event<BR> - 5.1 Surround Sound",
        "id": 27,
        "name": "Michael W. Smith: A New Hallelujah - Live",
        "picture": "http://ecx.images-amazon.com/images/I/511rezGnkqL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "No Description Available<br>No Track Information Available<br><b>Media Type: </b>CD<br><b>Artist: </b>TESTAMENT<br><b>Title: </b>NEW ORDER<br><b>Street Release Date: </b>05/10/1988<br><Domestic or Import: </b>Domestic<br><b>Genre: </b>HEAVY METAL",
        "id": 28,
        "name": "Testament - The New Order",
        "picture": "http://ecx.images-amazon.com/images/I/51FMducAxeL._SL160_.jpg",
        "price": 522
    },
    {
        "desc": "All products are BRAND NEW and factory sealed. Fast shipping and 100% Satisfaction Guaranteed.",
        "id": 29,
        "name": "The Jessye Norman Collection - Richard Strauss Lieder",
        "picture": "http://ecx.images-amazon.com/images/I/51ZOAdu8ErL._SL160_.jpg",
        "price": 553
    },
    {
        "desc": "The Smiths formed in Manchester in 1982 and quickly rose to become the quintessential British indie rock band of their day. Powered by the collaboration between lead singer and lyricist Morrissey and lead guitarist and co-songwriter Johnny Marr, their sound had a literary and musical depth that was complex, emotional and often controversial-at the same time, it rang with The Smiths' unique twist on timeless melodic pop sensibilities. On Rhino's new compilation, the group's biggest hits and most important tracks are represented.",
        "id": 30,
        "name": "The Smiths - The Sound Of The Smiths: The Very Best Of The Smiths",
        "picture": "http://ecx.images-amazon.com/images/I/51J26GK6pNL._SL160_.jpg",
        "price": 584
    },
    {
        "desc": "The propulsive beats inside Joy Division's dark post-punk rose up and flowered after the surviving members formed New Order, and a new era of dance-rock was born. Here' the only single-CD collection that spans their entire career: 12\" mixes of Blue Monday; Confusion; The Perfect Kiss; Bizarre Love Triangle , and True Faith plus Ceremony; Crystal , and more. Bonus DVD includes three music videos!",
        "id": 31,
        "name": "New Order - International: Best of New Order",
        "picture": "http://ecx.images-amazon.com/images/I/418PZZRFVVL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "No Description Available.<br><b>Genre: </b>Popular Music<br><b>Media Format: </b>Compact Disk<br><b>Rating: </b><br><b>Release Date: </b>20-JAN-1989",
        "id": 32,
        "name": "Smiths - The Smiths",
        "picture": "http://ecx.images-amazon.com/images/I/41Q1MXKWBBL._SL160_.jpg",
        "price": 584
    },
    {
        "desc": "Rockabye Baby transforms timeless rock songs into  beautiful instrumental lullabies. Guitars and drums are  traded for soothing mellotrons, vibraphones and bells, and  the volume is turned down from an eleven to a two.  Rockabye Baby is the perfect way to share the music you  love with the littlest rocker in your life.  Just can't get enough sleep? Babies are babies but why  should it be that you get no peace. Rockabye Baby  answers your prayer for a night of joyous silence. The next  time your little one plans on being up all night, try spinning  our lullaby renditions of these Depeche Mode favorites. It's  all the baby ever wanted and all they've ever needed.",
        "id": 33,
        "name": "Rockabye Baby! - Rockabye Baby! Lullaby Renditions of Depeche Mode",
        "picture": "http://ecx.images-amazon.com/images/I/51b0qG-BG-L._SL160_.jpg",
        "price": 523
    },
    {
        "desc": "Over 50 years after its original 1952 vinyl release, this is still the best American roots music collection around! Musicologist Harry Smith assembled the anthology from 78 rpm discs issued between 1927 and 1935. This 6-CD reissue was painstakingly researched, annotated and packaged to perfection. With 84 rare tracks, this one is a library all by itself! Includes Drunkard's Special Coley Jones; Peg and Awl Carolina Tar Heels; Frankie Mississippi John Hurt; Engine 143 Carter Family; Indian War Whoop Hoyt Ming & His Pep-Steppers; Newport Blues Cincinnati Jug Band; John the Revelator Blind Willie Johnson; Fifty Miles of Elbow Room Rev. F.W. McGee; Sugar Baby Dock Boggs; See That My Grave Is Kept Clean Blind Lemon Jefferson; The Lone Star Trail Ken Maynard, and many more!",
        "id": 34,
        "name": "Various Artists - Anthology Of American Folk Music (Edited By Harry Smith)",
        "picture": "http://ecx.images-amazon.com/images/I/51X1mQc-MJL._SL160_.jpg",
        "price": 2618
    },
    {
        "desc": "Originally released in 1994, this definitive New Order documentary traces the history of the band all the way back to the Joy Division days. This extended version contains additional interviews and live footage-over two hours available for the first time as a single DVD release. [138 MIN.; COLOR; NOT RATED]",
        "id": 35,
        "name": "New Order - New Order Story",
        "picture": "http://ecx.images-amazon.com/images/I/51JcQ8k5GKL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "Roxy Music's unique blend of avant-garde rock music and high style set the tone for the whole glam rock era. They were much imitated but never equaled. This DVD tells the story of Roxy Music through new interviews with band members Bryan Ferry, Phil Manzanera, Andy Mackay, Paul Thompson, Brian Eno and Eddie Jobson plus many of their contemporaries. The program covers their early years, the classic seventies albums, their re-emergence with a much smoother style in the early eighties, the band's break up and then their hugely successful reunion in the 21st century. Originally broadcast by the BBC in late 2008, the DVD contains nearly half an hour of additional unseen material plus three bonus, previously unreleased live tracks. <P>BONUS FEATURES: <BR>Additional interview material not included in the broadcast version. <BR>Bonus live tracks from Dock Rock, London, 22nd July 2006: <BR>1) Both Ends Burning  <BR>2) Editions Of You  <BR>3) Do The Strand",
        "id": 36,
        "name": "More Than This: The Story of Roxy Music",
        "picture": "http://ecx.images-amazon.com/images/I/51e%2B8H3PMDL._SL160_.jpg",
        "price": 461
    },
    {
        "desc": "<b>U2'S RECORD BREAKING ROSE BOWL CONCERT</b><BR> Filmed on 25th October 2009<BR> <P>U2360° At The Rose Bowl was the penultimate gig of last year's U2360° tour in support of their Grammy-nominated album No Line on The Horizon. The Rose Bowl performance was the band's biggest show of 2009 and U2's biggest ever US show, with a live audience in excess of 97,000.  The show was also streamed across seven continents via YouTube. The first ever live streaming of a full-length stadium concert, U2360° at the Rose Bowl had over 10 million views on the channel in one week.  <P>Shot entirely in HD, the concert was filmed with 27 cameras and directed by Tom Krueger who had previously worked on U23D, the first live action 3D concert movie taken from U2's Vertigo Tour.  Available in standard and two disc deluxe DVD formats, U2360° At The Rose Bowl will also be U2's first concert available in Blu-ray. The deluxe formats and the Blu-ray will feature a new documentary called Squaring the Circle: Creating U2360°, with new interviews from U2, Paul McGuinness and the team behind the touring production.<BR> ",
        "id": 37,
        "name": "U2 - 360° AT THE ROSE BOWL [2 DVD Digipack]",
        "picture": "http://ecx.images-amazon.com/images/I/510EdYwIhzL._SL160_.jpg",
        "price": 923
    },
    {
        "desc": "Depeche Mode Tribute Album.",
        "id": 38,
        "name": "Various Artists - For The Masses: An Album of Depeche Mode Songs",
        "picture": "http://ecx.images-amazon.com/images/I/61MKksPXPhL._SL160_.jpg",
        "price": 369
    },
    {
        "desc": "The 'Very Best Of The Human League' captures the band's biggest hits including the classic and innovative music video anthems 'Don't You Want Me', 'Mirror Man', 'Human' and '(Keep Feeling) Fascination' on one DVD collection.  28 tracks in all!",
        "id": 39,
        "name": "Very Best of",
        "picture": "http://ecx.images-amazon.com/images/I/51KAWZ3243L._SL160_.jpg",
        "price": 1016
    },
    {
        "desc": "<b>U2'S RECORD BREAKING ROSE BOWL CONCERT</b><BR> Filmed on 25th October 2009<BR> <P>U2360° At The Rose Bowl was the penultimate gig of last year's U2360° tour in support of their Grammy-nominated album No Line on The Horizon. The Rose Bowl performance was the band's biggest show of 2009 and U2's biggest ever US show, with a live audience in excess of 97,000.  The show was also streamed across seven continents via YouTube. The first ever live streaming of a full-length stadium concert, U2360° at the Rose Bowl had over 10 million views on the channel in one week.  <P>Shot entirely in HD, the concert was filmed with 27 cameras and directed by Tom Krueger who had previously worked on U23D, the first live action 3D concert movie taken from U2's Vertigo Tour.  Available in standard and two disc deluxe DVD formats, U2360° At The Rose Bowl will also be U2's first concert available in Blu-ray. The deluxe formats and the Blu-ray will feature a new documentary called Squaring the Circle: Creating U2360°, with new interviews from U2, Paul McGuinness and the team behind the touring production. <P><b>CONCERT:</b><BR> Get On Your Boots<BR> Magnificent<BR> Mysterious Ways<BR> Beautiful Day<BR> I Still Haven't Found What I'm Looking For<BR> Stuck In A Moment You Can't Get Out Of<BR> No Line On The Horizon<BR> Elevation<BR> In A Little While<BR> Unknown Caller<BR> Until the End of the World<BR> The Unforgettable Fire<BR> City of Blinding Lights<BR> Vertigo<BR> I'll Go Crazy If I Don't Go Crazy Tonight<BR> Sunday Bloody Sunday<BR> MLK<BR> Walk On<BR> One<BR> Where The Streets Have No Name<BR> Ultra Violet (Light My Way)<BR> With Or Without You<BR> Moment Of Surrender<BR> <P>Aspect 16:9<BR> 1080i<BR> Sound (Concert):  PCM Stereo, DTS-HD Master Audio 5.1, Dolby Digital 5.1<BR> Sound (Bonus Material):  Dolby Digital Stereo<BR> Duration:  4 hours 11 Minutes (approx)<BR> Language:  English<BR> Subtitles:  English, French, Spanish, German, Portuguese (Not including any subtitling of songs)<BR>",
        "id": 40,
        "name": "U2: 360° at the Rose Bowl [Blu-ray]",
        "picture": "http://ecx.images-amazon.com/images/I/51c9BtrtR2L._SL160_.jpg",
        "price": 831
    },
    {
        "desc": "Deluxe 2 CD version, with disc 2 containing choice B sides, live cuts, and rarities. The Smiths formed in Manchester in 1982 and quickly rose to become the quintessential British indie rock band of their day. Powered by the collaboration between lead singer and lyricist Morrissey and lead guitarist and co-songwriter Johnny Marr, their sound had a literary and musical depth that was complex, emotional and often controversial-at the same time, it rang with The Smiths' unique twist on timeless melodic pop sensibilities. On Rhino's new compilation, the group's biggest hits and most important tracks are represented.",
        "id": 41,
        "name": "The Smiths - The Sound of the Smiths: The Very Best of the Smiths",
        "picture": "http://ecx.images-amazon.com/images/I/51pNqR8yR6L._SL160_.jpg",
        "price": 923
    },
    {
        "desc": "The popularity of The Human League never seems to wane, with constant sell-out tours and festival appearances (Homelands and Big Gay Out in 2005).  2005 saw  the League back on a 16-date tour of the UK in November.  To coincide with their touring activities, a collection of original 12-inch remixes of their most popular tracks are features, many of which have not been on CD before - such as the full unedited versions of 'The Sound Of The Crowd', 'Open Your Heart' and 'The Lebanon'. Additionally, 'Love Action' and 'Hard Times Instrumental 12-inches were only previously available on a CD single, and the rest of the tracks (bar the Extended Electric Dreams which came out on the reissued Oakey & Moroder CD reissue) are currently only to be found as bonus tracks on various US and International pressings. EMI. 2005.",
        "id": 42,
        "name": "The Human League - The Human League Original Remixes & Rarities",
        "picture": "http://ecx.images-amazon.com/images/I/31qwRRZTuiL._SL160_.jpg",
        "price": 399
    },
    {
        "desc": "colore coloriformato video full screensistema palcodifica area 0 (all)lingue ingleseaudio pcm",
        "id": 43,
        "name": "Human League - Very Best of Human League",
        "picture": "http://ecx.images-amazon.com/images/I/41oYVrxaNxL._SL160_.jpg",
        "price": 1416
    },
    {
        "desc": "First they went platinum...Now they're going green. Your best loved music in its simplest form. 20 best-selling \"Greatest Hits\" & \"Best of\" collections now available in a new eco-friendly package. 1CD in card wallet packaging - no plastic, no booklet - just great music! Booklets are available online through a unique URL on the package.",
        "id": 44,
        "name": "Will Smith - Will Smith - Greatest Hits",
        "picture": "http://ecx.images-amazon.com/images/I/51RxjSvcGHL._SL160_.jpg",
        "price": 276
    },
    {
        "desc": "Their summer 2001 reunion tour let fans see them live for the first time in 25 years-now, this new single-disc anthology collects the key tracks by one of modern rock's most influential bands! Includes Avalon; Jealous Guy; Over You; Same Old Scene; Angel Eyes; Dance Away; Both Ends Burning; Love Is the Drug; Street Life; Do the Strand; Virginia Plain; Re-Make/Re-Model , and six more!",
        "id": 45,
        "name": "Roxy Music - The Best of Roxy Music",
        "picture": "http://ecx.images-amazon.com/images/I/51sjAvdYlkL._SL160_.jpg",
        "price": 367
    },
    {
        "desc": "Excellent 1996 album. Saw cut into spine does not appear to touch art. Small crack in back of jewel box.",
        "id": 46,
        "name": "Curtis Mayfield - New World Order",
        "picture": "http://ecx.images-amazon.com/images/I/51bXr5oy8%2BL._SL160_.jpg",
        "price": 522
    },
    {
        "desc": "Import only compilation on EMI features 20 hits from 1972-1994 by Ferry as both a solo artist & as leader of Roxy Music. Includes 'More Than This', 'Love Is The Drug', 'Slave To Love', 'Dance Away', 'Avalon', 'I Put A Spell On You', 'Jealous Guy', 'Is Your Love Strong Enough?', 'Kiss And Tell', 'Same Old Scene', 'Your Painted Smile', 'Virginia Plain' and many more. EMI.",
        "id": 47,
        "name": "Bryan Ferry, Roxy Music - More Than This: The Best Of Bryan Ferry And Roxy Music",
        "picture": "http://ecx.images-amazon.com/images/I/41KYA16RZ6L._SL160_.jpg",
        "price": 553
    },
    {
        "desc": "Parents on the lookout for offbeat nursery music might find what they're looking for in Rockabye Baby! Lullaby Renditions of U2. An ethereal chorus of glockenspiels, toy pianos, sleigh bells, and synthesizers put a new spin on songs like \"The Sweetest Thing,\" \"Desire,\" and \"With or Without You,\" often to good effect. While there isn't anything particularly revelatory about hearing these instrumental renditions of U2's work, there's nothing unpleasant about them either. Added bonuses can be found in the D.I.Y. mobile in the liner notes and the unintentional typos on the back cover (\"U2 are Irelands' legendary musical heros\"). This collection is a perfect find for expectant U2 fans and those with a penchant for the strange. ~ Margaret Reges, Rovi",
        "id": 48,
        "name": "Rockabye Baby! - Rockabye Baby! Lullaby Renditions of U2",
        "picture": "http://ecx.images-amazon.com/images/I/51N0QRHS9HL._SL160_.jpg",
        "price": 523
    },
    {
        "desc": "Studio: Uni Dist Corp (music)  Release Date: 10/09/2002",
        "id": 49,
        "name": "Depeche Mode: One Night in Paris - The Exciter Tour 2001",
        "picture": "http://ecx.images-amazon.com/images/I/51M4JlmHf7L._SL160_.jpg",
        "price": 769
    },
    {
        "desc": "On two magical evenings in August of 2001, Ian McCulloch and Will Sargeant, founding fathers of the punk darlings Echo & The Bunnymen, joined their current bandmates for a  special live performance at Paul McCartney's Liverpool Institite for the Performing Arts. The result is this  stunning video now remixed in full 5.1 surround sound. This DVD features 21 live tracks, as well as 4 bonus videos.",
        "id": 50,
        "name": "Echo & Bunnymen - Echo and the Bunnymen: Live in Liverpool",
        "picture": "http://ecx.images-amazon.com/images/I/21-ECwrw%2BVL._SL160_.jpg",
        "price": 615
    },
    {
        "desc": "This performance was filmed & recorded at The Shepherds Bush Empire (UK) in 2005.  It includes an incredible 20-song set as well as an exclusive interview with Ian McCulloch & Will Sergeant.  Echo & the Bunnymen's melancholy post-punk and psychedelic rock",
        "id": 51,
        "name": "Echo & Bunnymen - Echo & the Bunnymen: Dancing Horses",
        "picture": "http://ecx.images-amazon.com/images/I/41dseBb0t7L._SL160_.jpg",
        "price": 614
    },
    {
        "desc": "No Description Available<br>No Track Information Available<br><b>Media Type: </b>DVD<br><b>Artist: </b>DEPECHE MODE<br><b>Title: </b>TOURING THE ANGEL-LIVE IN MILAN<br><b>Street Release Date: </b>09/26/2006<br><Domestic or Import: </b>Domestic<br><b>Genre: </b>ROCK/POP",
        "id": 52,
        "name": "Depeche Mode: Touring the Angel - Live in Milan",
        "picture": "http://ecx.images-amazon.com/images/I/51A72AX6QRL._SL160_.jpg",
        "price": 584
    },
    {
        "desc": "New Order formed in Manchester in 1980, rising from the ashes of U.K.<br>post-punk icons Joy Division after lead singer Ian Curtis death. Guitarist<br>Bernard Sumner took on vocal duties, and with drummer Stephen Morris,<br>bassist Peter Hook and keyboardist Gillian Gilbert, became one of the<br>biggest British groups of their era. Pioneering<br>the fusion of new wave, alt-rock, electronica,<br>synth-pop and club music, their unique sound<br>was as thought-provoking and soulful as it was<br>dancefloor-ready. Featuring 17 tracks spanning<br>1981-1993, this single disc survey of their<br>influential work features signature hits<br>including Bizarre Love Triangle, World In<br>Motion, Regret, True Faith, and their<br>breakthrough smash Blue Monday.",
        "id": 53,
        "name": "New Order - The Best of New Order",
        "picture": "http://ecx.images-amazon.com/images/I/41te6Q2Gt0L._SL160_.jpg",
        "price": 369
    },
    {
        "desc": "In December 2006, Stan Lee, Joe Quesada, and Kevin Smith got together on stage at UCLA to reflect, tell stories, wax philosophic and otherwise act silly in front of 1,000 comic fans to benefit The Hero Initiative, the only federally chartered not-for-profit charity that delivers assistance to comic creators in need. So we could blackmail them all with it later, we taped it all for you: Backstage, behind the scenes, the VIP room an even 2 1/2 hours of three grown men sitting on very expensive couches talking about comic books. It's all here, plus extras: * Behind the scenes reel * VIP Room footage * Extra interviews with guests, including: * Stan Lee * Joe Quesada * Kevin Smith * Jeph Loeb * Brian Pulido * Commentary by Hero Initiative President Jim McLauchlin and others * Edited version (for little ears) * Backstage on onstage photo gallery * Trailers for other related releases and events \"Part of the downside of live events is that only the people near the venue can see them,\" said Jim McLauchlin, president of Hero Initiative. \"With this DVD, everyone will have the opportunity to watch this historic, if not surrealistic, event. It had everything - Stan was en fuego, Joe was eloquent and passionate, and Kevin made a lot of comments involving flatus events and male genitalia. It was both sublime and ridiculous at the same time, and I think that was the heart of its charm. And the special features are going to take the fans backstage so they can see how this kind of show comes together.\" Like the live event, proceeds from the sales of the DVD go to the Hero Initiative.",
        "id": 54,
        "name": "Live - Marvel: Then & Now - A Night With Stan Lee, Joe Quesada, Hosted by Kevin Smith",
        "picture": "http://ecx.images-amazon.com/images/I/41Z8T1FEYeL._SL160_.jpg",
        "price": 769
    },
    {
        "desc": "In 2011, U2 returned to Hansa Studios in Berlin to discuss the making of Achtung Baby. From The Sky Down, is a documentary film directed by Academy Award winning director Davis Guggenheim (It Might Get Loud, Waiting for Superman, An Inconvenient Truth). Screened in the UK as part of the BBC's Imagine Series, From The Sky Down was the first ever documentary film to open the prestigious Toronto International Film Festival. From The Sky Down includes bonus footage of So Cruel, Love Is Blindness, and The Fly shot in May 2011 during the band's visit to Hansa Studios to mark the 20th anniversary of Achtung Baby; as well as a Q&A with Bono, The Edge and Davis Guggenheim filmed at the Toronto International Film Festival in September 2011. Twenty years after the release of U2's Achtung Baby (1991), Davis Guggenheim charts the path toward this groundbreaking album. Guggenheim uses animation and unseen footage from Berlin and Dublin alongside conversation to reveal what is now a key chapter in U2's career.",
        "id": 55,
        "name": "U2: From The Sky Down",
        "picture": "http://ecx.images-amazon.com/images/I/51f9f6681EL._SL160_.jpg",
        "price": 615
    },
    {
        "desc": "With Rage Against the Machine gone and most punk outfits wallowing in self-pity, 2003 is an ideal time for Killing Joke to reform. Though it's been seven years since 1996's <I>Democracy</I>, their protest music has lost none of its edge. Railing against the crushing power of massive conglomerates, the machinations of oil barons and corrupt governments, and the steady erosion of personal freedoms, Jaz Coleman's concerns have never been more relevant. If the bad guys don't get you, he opines during the driving, menacing \"Asteroid,\" you might yet be vaporised by huge rocks from space. Musically, too, this Killing Joke lineup belies its collective years. Alongside Coleman stand original members Geordie and Youth, backed up by stalwart Raven and fierce stand-in drummer Dave Grohl. <I>--Dominic Wills</I>",
        "id": 56,
        "name": "Killing Joke - Killing Joke",
        "picture": "http://ecx.images-amazon.com/images/I/318GTARVTJL._SL160_.jpg",
        "price": 430
    },
    {
        "desc": "Haydn & Beethoven : Arrangements de Chansons Ã©cossaises, pour voix, violon & piano - MÃ©lodies anglaises de Dowland, Campian, Purcell, Boyce, Arne, Monro / Janet Baker, mezzo-soprano - Yehudi Menuhin, violon & George Malcolm, clavecin & piano - Ross Pople, violoncelle - Robert Spencer, luth",
        "id": 57,
        "name": "Janet Baker - Haydn, Beethoven: Scottish Folk Song Arrangements (H.31a;Op.108,etc.) / English Songs",
        "picture": "http://ecx.images-amazon.com/images/I/517o%2BiEZmjL._SL160_.jpg",
        "price": 800
    },
    {
        "desc": "The Influencial Synth-Pop Masters Live.  This live DVD, filmed in Brighton in December 2003, marked the climax to their hugely successful '03 tour.  It can't be called a comeback tour: media exposure of them and their music - in clever car commercials or",
        "id": 58,
        "name": "Human League - Human League - Live at the Dome",
        "picture": "http://ecx.images-amazon.com/images/I/41KP0K4J2TL._SL160_.jpg",
        "price": 614
    }
]